/******************************************************************************
* @file
* Данный файл просто включает все нужные файлы для работы мини-библиоткеи XMLB
*
* @author Bruvamasc
* @date   2022-09-17
*
* @todo Нужно подумать, как добавить режим дебага
* ///< Указывает, что элемент недоступен для использования
*
******************************************************************************/

#ifndef XMLB_H
#define XMLB_H

#include "XMLB_Constants.h"
#include "XMLB_Document.h"
#include "XMLB_Node.h"
#include "XMLB_Parser.h"

#endif // !XMLB_H